{
  "highest_point_m": 1038,
  "facts": "The Republic of Ireland occupies most of the island of Ireland, off the coast of England and Wales. Its capital, Dublin, is the birthplace of writers like Oscar Wilde, and home of Guinness beer. The 9th-century Book of Kells and other illustrated manuscripts are on show in Dublin’s Trinity College Library. Dubbed the \"Emerald Isle” for its lush landscape, the country is dotted with castles like medieval Cahir Castle.",
  "name": "Ireland",
  "flag": "https://flagpedia.net/data/flags/w1160/ie.webp",
  "code": "Ireland.",
  "population": 5300000,
  "currency": "Euro €",
  "history": "Ireland's history stretches from prehistoric hunter-gatherers to the formation of the modern Republic of Ireland and Northern Ireland, which remains in the UK. Key periods include the Celtic Iron Age, the arrival of Christianity with St. Patrick, Viking invasions that established towns, and the Anglo-Norman invasion that began a long period of English dominance. The Great Famine in the 1840s devastated the population, and the early 20th century saw the Irish War of Independence, leading to the partition of the island in 1921 and the creation of the Irish Free State (now the Republic of Ireland) and Northern Ireland within the UK.",
  "video_embed": "https://www.youtube.com/embed/Hem4PTwgzMs?si",
  "location": "https://www.google.com/maps/place/Ireland/@53.4984958,-7.3964379,7z/data=!4m9!1m2!2m1!1sIreland!3m5!1s0x4859bae45c4027fb:0xcf7c1234cedbf408!8m2!3d53.41291!4d-8.24389!16zL20vMDNydDk?g_ep=Eg1tbF8yMDI1MDgyN18wIOC7DCoASAJQAg%3D%3D",
  "animals": [
    "Toward the end of the last Ice Age, some 2.6 million years ago, rising sea levels cut Ireland off from the European mainland. This led to the evolution of some uniquely adapted animals on the Emerald Isle, Ireland’s nickname for its immense greenery. Twenty-six terrestrial mammals are native to Ireland, including the Irish hare, the Irish stoat, the Irish grey partridge, and ten species of bats. Though well over 450 unique bird species call Ireland home for at least part of the year, all but two of these species are migratory.  Ireland is known for other species that have flourished there – like the Connemara pony, the athletic ponies known for their sweet dispositions, intelligence, and hardy good health. Wild herds of these ponies run wild in Connemara today, while Connemara ponies are bred all over the world to be show horses.  Galway sheep is a breed that originated in Galway, in the west of Ireland. These large, white-faced sheep are known for their characteristic bob of wool on the tops of their heads and for their wooly legs. Galways are mostly raised for meat but there are efforts to promote the use of their wool.  Far more animal species flourished in Ireland throughout the Ice Age, including the wooly mammoth, the wild horse, the Irish elk (also called giant deer), and a brown bear species thought by biologists to be an ancestor to today’s polar bear. Predatory human hunting likely contributed to these animals’ extinction."
  ],
  "images": [
    "uploads/img_0590.jpeg",
    "https://images.squarespace-cdn.com/content/v1/58cd67dfcd0f68a0be53c102/1687203972174-LAY1DXF4RB9WLA1PZELV/Screen+Shot+2023-06-19+at+19.37.11.png?format=1000w"
  ],
  "languages": [
    "Irish Gaelic",
    "English"
  ],
  "area_km2": 70274
}
