{
  "highest_point_m": 2469,
  "facts": "Norway is a Scandinavian country encompassing mountains, glaciers and deep coastal fjords. Oslo, the capital, is a city of green spaces and museums. Preserved 9th-century Viking ships are displayed at Oslo’s Viking Ship Museum. Bergen, with colorful wooden houses, is the starting point for cruises to the dramatic Sognefjord. Norway is also known for fishing, hiking and skiing, notably at Lillehammer’s Olympic resort.",
  "name": "NO",
  "flag": "https://flagpedia.net/data/flags/w1160/no.webp",
  "code": "Norway",
  "population": 56000000,
  "currency": "Kroner",
  "history": "Norway's history includes the Viking Age from the 8th to 11th centuries, unification under a single king in 872, a prolonged period under Danish rule (1387–1814), a subsequent union with Sweden (1814–1905), and eventual full independence in 1905. During World War II, Norway was occupied by Germany before joining the United Nations and NATO in the post-war era. ",
  "video_embed": "https://www.youtube.com/embed/C5zORsjab5Q?si",
  "location": "Norway, Scandinavia",
  "animals": [
    " Terrestrial mammals on mainland Norway include the European hedgehog, six species of shrews and ten of bats. The European rabbit, the European hare and the mountain hare all live here as do the Eurasian beaver, the red squirrel and the brown rat as well as about fifteen species of smaller rodent. Of the ungulates, the wild boar, the muskox, the fallow deer, the red deer, the elk (N. American usage: 'moose'), the roe deer and the reindeer are found in the country.[10] Terrestrial carnivores include the brown bear, the Eurasian wolf, the red fox and the Arctic fox, as well as the Eurasian lynx, the European badger, the Eurasian otter, the stoat, the least weasel, the European polecat, the European pine marten and the wolverine. The coast is visited by the walrus and six species of seal, and around thirty species of whale, dolphin and porpoise are found in Norwegian waters."
  ],
  "images": [
    "uploads/img_0592.jpeg",
    "https://cdn.vectorstock.com/i/1000v/41/89/norway-wildlife-geography-animals-birds-vector-51344189.jpg",
    "https://www-worldwideboat-com.exactdn.com/wp-content/themes/worldwide-boat/images/Norway-fjord-1.jpg?strip=all&lossy=1&quality=92&ssl=1"
  ],
  "languages": [
    "norwegian"
  ],
  "area_km2": 323804
}
